package tema09_Interfaces.ejerciciosPropuestos.ejercicioPropuesto06_ListaImplementsColaPilaObject.interfaces;

/***********************************************************************************************************************
 * Interfaz Cola.                                                                                                      *
 ***********************************************************************************************************************/
public interface Cola {
    /*******************************************************************************************************************
     * Método abstracto encargado de push elementos de tipo Object.                                                    *
     *                                                                                                                 *
     * @param objeto Object a encolar.                                                                                 *
     *******************************************************************************************************************/
    void push(Object objeto);

    /*******************************************************************************************************************
     * Método encargado de desencolar elementos de tipo Object.                                                        *
     *                                                                                                                 *
     * @return Devuelve el Object desencolado.                                                                         *
     *******************************************************************************************************************/
    Object popCola();
}
