package tema09_Interfaces.ejerciciosPropuestos.ejercicioPropuesto02_ListaImplementsColaPila.interfaces;

/***********************************************************************************************************************
 * Interfaz Cola.                                                                                                      *
 ***********************************************************************************************************************/
public interface Cola {
    /*******************************************************************************************************************
     * Método abstracto encargado de push elementos de tipo String.                                                    *
     *                                                                                                                 *
     * @param strCadena String a encolar.                                                                              *
     *******************************************************************************************************************/
    void push(String strCadena);

    /*******************************************************************************************************************
     * Método encargado de desencolar elementos de tipo String.                                                        *
     *                                                                                                                 *
     * @return Devuelve el String desencolado.                                                                         *
     *******************************************************************************************************************/
    String popCola();
}
